# Brewfile - Mac Development Environment
# Usage: brew bundle install

# ============================================================================
# Command Line Tools
# ============================================================================
brew "docker-completion"  # Shell autocomplete for Docker commands
brew "git"
brew "nvm"
brew "uv"
brew "wget"
brew "yarn"
brew "zsh-autosuggestions"    # Fish-like autosuggestions for zsh
brew "zsh-syntax-highlighting" # Syntax highlighting for zsh commands
brew "commitizen"              # Conventional commit messages

# ============================================================================
# GUI Applications
# ============================================================================
# Browsers
cask "google-chrome"
cask "tor-browser"

# Code Editors
cask "cursor"
cask "visual-studio-code"

# Development Tools
cask "docker"    # Docker Desktop (includes engine + GUI)
cask "ghostty"   # Modern GPU-accelerated terminal
cask "insomnia"  # API client
cask "postgres-unofficial"  # Postgres.app (GUI for PostgreSQL)
cask "tableplus" # Database GUI

# Productivity
cask "caffeine"
cask "flux"
cask "notion"
cask "rectangle"

# Communication
cask "discord"
cask "slack"
