# Brewfile - Mac Development Environment
# Usage: brew bundle install

# ============================================================================
# Taps (Third-party Repositories)
# ============================================================================
tap "romkatv/powerlevel10k"

# ============================================================================
# Command Line Tools
# ============================================================================
brew "git"
brew "nvm"
brew "powerlevel10k"
brew "uv"
brew "wget"
brew "yarn"

# Zsh Plugins
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# ============================================================================
# GUI Applications
# ============================================================================
# Browsers
cask "google-chrome"
cask "tor-browser"

# Code Editors
cask "cursor"
cask "visual-studio-code"

# Development Tools
cask "docker"    # Containerization
cask "ghostty"   # Modern GPU-accelerated terminal
cask "insomnia"  # API client
cask "iterm2"
cask "pgadmin4"
cask "postgres-unofficial"  # Postgres.app (GUI for PostgreSQL)
cask "tableplus" # Database GUI

# Productivity
cask "caffeine"
cask "flow"      # Pomodoro timer
cask "flux"
cask "notion"
cask "rectangle"

# Communication
cask "discord"

# Font
cask "font-meslo-lg-nerd-font"

