alefragnani.project-manager
charliermarsh.ruff
christian-kohler.npm-intellisense
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
github.vscode-github-actions
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
